app/controllers/file_upload_controller.rb

  def find_total_sales
    total_sales = 0.0

    begin
      total_sales = Company.find(current_user.id).total_sales
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT 1  [["id", "1"]]